{
  "backend/main.mo": "Motoko actor implementing a calculator with add, subtract, multiply, and divide operations, each storing results in a capped history of 10 entries filtered to the last 7 days.",
  "feature_evidence.json": "Feature evidence report linking the full-precision division display feature (up to 10 decimal places) to Calculator.tsx and associated components/test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their roles in the Study Calculator app.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark themes used across the app.",
  "frontend/index.html": "HTML entry point titled 'Study Calculator' that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the dark-themed app shell with a header (brand, on-chain indicator, HamburgerMenu), centered Calculator, and footer with caffeine.ai attribution.",
  "frontend/src/components/Calculator.tsx": "Main calculator orchestrator managing calc state, expression parsing/evaluation, full-precision division formatting (up to 10 decimal places), and wiring together Display, Keypad, and History components.",
  "frontend/src/components/CalculatorDisplay.tsx": "Display component rendering the expression line and result with neon-green styling, supporting error, loading, confirmed, and dimmer auto-preview states.",
  "frontend/src/components/CalculatorHistory.tsx": "Renders a scrollable sidebar panel displaying the last 7 days of calculation history entries with timestamps, loading skeletons, and an empty state. Clicking an entry invokes an optional callback to populate the calculator display with that result.",
  "frontend/src/components/CalculatorKeypad.tsx": "Defines the calculator keypad layout (digits, operators, advanced functions) and renders styled buttons with hover effects. Exposes an `onButton` callback and applies per-type inline styles and Tailwind hover classes.",
  "frontend/src/components/HamburgerMenu.tsx": "A responsive hamburger menu button that toggles a slide-in dropdown panel with Calculator, History, and About navigation items. Closes on outside click or Escape key press.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, keyed by the current identity principal. Invalidates and refetches all non-actor queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing Internet Identity authentication via `AuthClient`, exposing login/clear functions and status flags. Persists and validates delegated identities across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for calculator operations (add, subtract, multiply, divide) and history retrieval, falling back to local computation when the actor is unavailable. Timestamps are cached in localStorage and merged with backend history entries for display.",
  "frontend/src/index.css": "Global CSS file that imports JetBrains Mono and Inter fonts, sets up Tailwind directives, and defines OKLCH-based CSS custom properties for a dark calculator theme including neon glow utilities and button press animations.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider, then mounts it to the DOM root.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Inter/JetBrains Mono fonts, OKLCH-based color tokens for UI and calculator-specific elements, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing a calculator app fix request where division results should display full decimal precision up to 10 places (e.g., 10 รท 3 = 3.3333333333) instead of being truncated."
}