{
  "backend/main.mo": "Motoko actor implementing a calculator with add, subtract, multiply, and divide operations, each storing results in a capped 10-entry calculation history accessible via a query method.",
  "feature_evidence.json": "Feature evidence report confirming high-confidence implementation of the hamburger menu feature in App.tsx and HamburgerMenu.tsx.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short descriptions covering styles, hooks, and all calculator UI components including the new HamburgerMenu.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark themes including background, foreground, sidebar, and chart color tokens.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root layout component rendering a dark-themed header with brand logo, on-chain indicator, and HamburgerMenu, a centered Calculator, and a footer with attribution link.",
  "frontend/src/components/Calculator.tsx": "Main calculator component managing arithmetic state, keyboard input, and calling backend mutation hooks for add, subtract, multiply, and divide operations.",
  "frontend/src/components/CalculatorDisplay.tsx": "Display component rendering the current expression and result with neon-green styling, scanline overlay, loading dots animation, and red error state.",
  "frontend/src/components/CalculatorHistory.tsx": "Scrollable history panel displaying up to 10 past calculations with click-to-reuse, loading skeletons, and an empty state illustration.",
  "frontend/src/components/CalculatorKeypad.tsx": "Renders a 4-column calculator keypad grid with styled buttons (digits, operators, equals, clear, special) and delegates button press events via an `onButton` callback.",
  "frontend/src/components/HamburgerMenu.tsx": "A hamburger menu button that toggles a slide-in dropdown panel with Calculator, History, and About items, closing on outside click or Escape key.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching calculation history and performing add, subtract, multiply, and divide mutations against the backend actor, invalidating history on each mutation success.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind layers, defines CSS custom properties for the dark calculator theme using OKLCH colors, and adds utility classes for neon glows and button press animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, Inter/JetBrains Mono fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the Study Calculator app's project state, including an existing feature for a hamburger menu button and a pending action request to add it to the app header."
}