{
  "backend/main.mo": "Motoko actor implementing a calculator with add, subtract, multiply, and divide operations, each storing results in a capped 10-entry calculation history.",
  "feature_evidence.json": "Feature evidence report confirming the app rename to 'Study Calculator' is implemented in frontend/index.html and frontend/src/App.tsx.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH-based light/dark theme variables for backgrounds, borders, charts, and sidebar colors.",
  "frontend/index.html": "Minimal HTML entry point setting the browser tab title to 'Study Calculator' and mounting the React app at #root.",
  "frontend/src/App.tsx": "Root React layout rendering a dark header with 'Study Calculator' branding and on-chain indicator, the Calculator component, and a footer with caffeine.ai attribution.",
  "frontend/src/components/Calculator.tsx": "Main calculator component managing digit, operator, decimal, and equals input state, keyboard listeners, and dispatching backend arithmetic mutations via React Query hooks.",
  "frontend/src/components/CalculatorDisplay.tsx": "Display component rendering the current expression and result with neon-green styling, scanline overlay, animated loading dots, and red error state.",
  "frontend/src/components/CalculatorHistory.tsx": "Scrollable history panel displaying up to 10 past calculations with click-to-reuse, loading skeletons, and an empty state illustration.",
  "frontend/src/components/CalculatorKeypad.tsx": "Defines and renders a 4-column calculator keypad grid with buttons for digits, operators, clear, backspace, decimal, and equals, each styled with oklch colors and hover/press animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching calculation history and performing add, subtract, multiply, and divide mutations against the backend actor, invalidating history on success.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind layers, defines CSS custom properties for the dark calculator theme, and adds utility classes for neon glow effects and button press animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with oklch-based semantic color tokens, custom calculator-specific colors, Inter/JetBrains Mono fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, existing implemented features (calculator UI, dark theme, app rename), and pending feature requests (backend arithmetic and history) with their requirement IDs and statuses."
}