{
  "backend/main.mo": "Motoko actor implementing a calculator with add, subtract, multiply, and divide operations, storing up to 10 recent calculation history entries with timestamps and supporting retrieval and clearing of history.",
  "feature_evidence.json": "Feature evidence report confirming that the CalculatorKeypad component was updated to have exactly one '=' button positioned at the bottom of the right column.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their roles in the Study Calculator app's styling, components, and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark themes covering background, foreground, card, border, and chart colors.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Study Calculator' and mounts the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component rendering the full app layout with a dark header (brand, on-chain indicator, HamburgerMenu), the Calculator component in the main area, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/Calculator.tsx": "Main calculator orchestrator managing expression parsing, operator handling, keyboard input, and auto-preview logic, composing CalculatorDisplay, CalculatorKeypad, and CalculatorHistory with backend mutation hooks.",
  "frontend/src/components/CalculatorDisplay.tsx": "Display component rendering the current expression and result with distinct styles for error, loading, confirmed, and auto-preview states using neon-green OKLCH colors and a scanline overlay effect.",
  "frontend/src/components/CalculatorHistory.tsx": "Renders a scrollable calculator history panel with timestamps, showing past calculations and a confirmation dialog to clear all history using the `useClearHistory` mutation.",
  "frontend/src/components/CalculatorKeypad.tsx": "Defines the calculator keypad layout (digits, operators, scientific functions) and renders styled buttons with hover effects, invoking an `onButton` callback on press.",
  "frontend/src/components/HamburgerMenu.tsx": "A hamburger menu button that toggles a slide-in dropdown panel with Calculator, History, and About navigation items, closing on outside click or Escape key.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, invalidating dependent queries whenever the actor or identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that manage DFINITY AuthClient login/logout state, persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for calculator operations (add, subtract, multiply, divide, history fetch, clear history), with local fallback computation and localStorage-based timestamp caching for history entries.",
  "frontend/src/index.css": "Global CSS file that imports JetBrains Mono and Inter fonts, sets up Tailwind directives, and defines OKLCH-based CSS custom properties for the dark theme including calculator-specific design tokens and utility classes for neon glow effects and button press animations.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Inter/JetBrains Mono fonts, OKLCH-based semantic color tokens (including calculator-specific calc-* colors), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file tracking version 3 of the calculator app, describing a fix request to remove duplicate '=' buttons from the keypad layout so only one '=' button exists at the bottom of the right column."
}